Documents/ПереводНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПереводНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СданВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОтправляемое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПолучаемое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереводНоменклатуры/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Записать();
	
	// Блокировку
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ПереводНоменклатурыСписокНоменклатуры.НомерСтроки) КАК НомерСтроки,
	|	СУММА(ПереводНоменклатурыСписокНоменклатуры.КоличествоОтправляемое) КАК КоличествоОтправляемое,
	|	СУММА(ПереводНоменклатурыСписокНоменклатуры.КоличествоПолучаемое) КАК КоличествоПолучаемое,
	|	ПереводНоменклатурыСписокНоменклатуры.НоменклатураИсточник,
	|	ПереводНоменклатурыСписокНоменклатуры.НоменклатураПолучатель
	|ПОМЕСТИТЬ втСписокНоменклатуры
	|ИЗ
	|	Документ.ПереводНоменклатуры.СписокНоменклатуры КАК ПереводНоменклатурыСписокНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ПереводНоменклатурыСписокНоменклатуры.НоменклатураПолучатель,
	|	ПереводНоменклатурыСписокНоменклатуры.НоменклатураИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСписокНоменклатуры.НомерСтроки,
	|	втСписокНоменклатуры.КоличествоОтправляемое,
	|	втСписокНоменклатуры.КоличествоПолучаемое,
	|	втСписокНоменклатуры.НоменклатураИсточник,
	|	втСписокНоменклатуры.НоменклатураПолучатель,
	|	ЕСТЬNULL(УправленческийОстатки.КоличествоОстатокДт, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстатокДт, 0) КАК СуммаОстаток
	|ИЗ
	|	втСписокНоменклатуры КАК втСписокНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	|				&МоментВремени,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.МатериалыНаСкладе),
	|				,
	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.Логистика)
	|					И Субконто1 = &Склад
	|					И Субконто2 В
	|						(ВЫБРАТЬ
	|							втСписокНоменклатуры.НоменклатураИсточник
	|						ИЗ
	|							втСписокНоменклатуры)) КАК УправленческийОстатки
	|		ПО втСписокНоменклатуры.НоменклатураИсточник = УправленческийОстатки.Субконто2";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Нехватка = Выборка.КоличествоОтправляемое - Выборка.КоличествоОстаток;
		Если Нехватка > 0 Тогда
			
			// сообщение об ошибке
			Сообщить("Недостаточно материала " + Выборка.НоменклатураИсточник);
			Отказ = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			Если Выборка.КоличествоОстаток <> 0 Тогда
				Себестоимость = Выборка.КоличествоОстаток / Выборка.КоличествоОтправляемое * Выборка.СуммаОстаток;
			Иначе
				Себестоимость = 0;
			КонецЕсли;
			
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Подразделение = Подразделение;
			Проводка.Период = Дата;
			Проводка.Сумма = Себестоимость;
			Проводка.СчетДт = ПланыСчетов.Управленческий.МатериалыНаСкладе;
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
			Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.НоменклатураПолучатель;
			Проводка.КоличествоДт = Выборка.КоличествоПолучаемое;
			
			Проводка.СчетКт = ПланыСчетов.Управленческий.МатериалыНаСкладе;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.НоменклатураИсточник;
			Проводка.КоличествоКт = Выборка.КоличествоОтправляемое;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		Движения.Управленческий.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры
